{
    "Murad Mohamed": "مراد محمد",
    "Projects": "المشاريع",
    "Home": "الرئيسية",
    "Let's talk": "تواصل",
    "switch_language": "EN",
    "Mobile Applications Developer based in Maadi, Egypt": "مطور تطبيقات في المعادي، مصر",
    "As an experience mobile applications developer, I create custom, high quality, and performant mobile applications that are fun to use.": "بصفتي مطور تطبيقات ذو خبرة، أقوم بإنشاء تطبيقات مخصصة وعالية الجودة وذات أداء ممتاز وممتعة للاستخدام.",
    "If you are hiring, reach out via email!": "إذا كنت توظف، تواصل معي عبر البريد الإلكتروني!",
    "Highlights": "أبرز الأعمال",
    " — hover!": " — مرر الماوس!",
    "Experience": "الخبرة",
    "code": "الكود",
    "Flutter Developer": "مطور فلاتر",
    "Built and maintained two cross platform applications. Introduced unit testing and resolved 94+ critical legacy bugs to ensure stable delivery.": "قمت ببناء وصيانة تطبيقين متعددي المنصات. قدمت اختبارات الوحدات وحللت أكثر من 94 خطأً حرجًا من الأكواد القديمة لضمان تسليم مستقر.",
    "Full Stack Mobile Developer": "مطور تطبيقات جوال شامل ",
    "Freelance": "عمل حر",
    "Successfully delivered over 5 fully functional mobile applications with 100% client satisfaction.": "نجحت في تسليم أكثر من 5 تطبيقات جوال وظيفية بالكامل مع رضا العملاء بنسبة 100%.",
    "This website": "هذا الموقع",
    "Personal portfolio website built with Flutter.": "موقع بورتفوليو شخصي (ملف أعمال) مبني باستخدام فلاتر.",
    "Secure & easy attendance application": "تطبيق حضور آمن وسهل",
    "Developed a secure attendance system that uses QR code scanning and geolocation to streamline event check-in, preventing fraudulent entries.": "تطوير نظام حضور آمن يستخدم مسح رمز QR وتحديد الموقع الجغرافي لتبسيط عملية تسجيل الوصول في الفعاليات ومنع الإدخالات الاحتيالية.",
    "Comprehensive e-commerce and ride-booking application.": "تطبيق شامل للتجارة الإلكترونية وحجز الرحلات.",
    "Built a comprehensive e-commerce and ride-booking mobile application using Flutter and OpenStreetMap.": "قمت ببناء تطبيق شامل ومتكامل للتجارة الإلكترونية وحجز الرحلات باستخدام فلاتر وخرائط الشارع المفتوحة (OpenStreetMap).",
    "Ride-booking platform with live GPS tracking and route optimization.": "منصة لحجز الرحلات مع تتبع مباشر عبر GPS وتحسين المسار.",
    "Developed a ride-booking platform with a focus on driver-passenger matching, live GPS tracking, and dynamic route optimization. Built a dual-interface system for both passengers and drivers, complete with role-based authentication and real-time status updates.": "تطوير منصة حجز رحلات تركز على مطابقة السائقين والركاب، وتتبع مباشر عبر GPS، وتحسين المسار بشكل ديناميكي. تم بناء نظام واجهة مزدوجة للركاب والسائقين، مع مصادقة قائمة على الأدوار وتحديثات للحالة في الوقت الفعلي.",
    "A real-time chat application": "تطبيق دردشة لحظية",
    "Led the development team of ArdentChat as part of the DEPI scholarship program, that supports 1,000+ users. Established a version control workflow and provided technical leadership.": "قدت فريق تطوير ArdentChat كجزء من برنامج منحة DEPI، وهو يدعم أكثر من 1,000 مستخدم. أسست سير عمل للتحكم في الإصدارات وقدمت القيادة الفنية.",
    "An dual-interface e-commerce application for both customers and delivery personnel.": "تطبيق تجارة إلكترونية بواجهة مزدوجة للعملاء وموظفي التوصيل.",
    "Developed Tamweeny, an e-commerce application specializing in food supplies with functionalities for both customers and delivery personnel.": "تطوير تطبيق تمويني، وهو تطبيق تجارة إلكترونية متخصص في توريدات المواد الغذائية بوظائف مخصصة للعملاء وموظفي التوصيل.",
    "Faculty Platform for student management, course enrollment, and scheduling.": "منصة الكلية لإدارة الطلاب وتسجيل المواد والجداول.",
    "Consulted on and integrated Firebase solutions to manage multiple user types. Implemented real-time updates and user access controls.": "استشرت وقمت بدمج حلول Firebase لإدارة أنواع متعددة من المستخدمين. نفذت تحديثات في الوقت الفعلي وضوابط للوصول حسب صلاحيات المستخدم.",
    "Freelance Gig": "عمل حر",
    "Group project": "مشروع جماعي",
    "Graduation project": "مشروع تخرج",
    "A mobile application designed to simplify attendance tracking for hosts and attendees. The app enables hosts to generate a unique QR code for a specific event, which attendees can then scan to register their presence. This provides a secure, real-time, and two-factor registration system.": "تطبيق موبايل مصمم لتبسيط تتبع الحضور للمضيفين والحاضرين. يتيح التطبيق للمضيفين إنشاء رمز QR فريد لحدث معين، يمكن للحاضرين مسحه لتسجيل وجودهم. يوفر هذا نظام تسجيل آمن، فوري، وثنائي العوامل.",
    "An e-commerce application with a combined focus on ride-hailing and ordering food/groceries. It aims to provide a platform where users can book rides, order meals from restaurants, and purchase groceries, all within a single app.": "تطبيق تجارة إلكترونية يركز بشكل مزدوج على طلب الرحلات وطلب الطعام/البقالة. يهدف إلى توفير منصة يمكن للمستخدمين من خلالها حجز الرحلات، وطلب الوجبات من المطاعم، وشراء البقالة، كل ذلك داخل تطبيق واحد."
}